playwright-artillery.yml
config:
  target: http://localhost:3000
  # target: http://localhost:3000

  phases:
  - duration: 10
    arrivalRate: 15

  engines:
    playwright:
      launchOptions:
        headless: true
    
  processor: "./stresstest/app.js"

scenarios:
  - engine: playwright
    flowFunction: "registerUser"